In [1]:
import numpy as np

In [3]:
import pandas as pd

In [4]:
data = np.random.randn(4,3)

In [5]:
data

array([[ 0.76300068, -0.80888172, -2.45188951],
       [-0.52967996, -0.58599173,  0.30174256],
       [-1.79522963, -0.23104183,  0.11742084],
       [ 1.11674202,  0.58114223, -1.61424014]])

In [8]:
data_frame = pd.DataFrame(data)

In [9]:
data_frame

          0         1         2
0  0.763001 -0.808882 -2.451890
1 -0.529680 -0.585992  0.301743
2 -1.795230 -0.231042  0.117421
3  1.116742  0.581142 -1.614240

In [12]:
new_df = pd.DataFrame(data, index = ["atil","zeynep","atlas","mehmet"], columns = ["salary", "age","seniority"])

In [13]:
new_df

          salary       age  seniority
atil    0.763001 -0.808882  -2.451890
zeynep -0.529680 -0.585992   0.301743
atlas  -1.795230 -0.231042   0.117421
mehmet  1.116742  0.581142  -1.614240

In [14]:
new_df["salary"]

atil      0.763001
zeynep   -0.529680
atlas    -1.795230
mehmet    1.116742
Name: salary, dtype: float64

In [15]:
new_df[["salary","seniority"]]

          salary  seniority
atil    0.763001  -2.451890
zeynep -0.529680   0.301743
atlas  -1.795230   0.117421
mehmet  1.116742  -1.614240

In [17]:
new_df.loc["atil"]

salary       0.763001
age         -0.808882
seniority   -2.451890
Name: atil, dtype: float64

In [18]:
new_df.iloc[0]

salary       0.763001
age         -0.808882
seniority   -2.451890
Name: atil, dtype: float64

In [19]:
new_df.iloc[:,1]

atil     -0.808882
zeynep   -0.585992
atlas    -0.231042
mehmet    0.581142
Name: age, dtype: float64

In [20]:
new_df["Extra"] = 10

In [21]:
new_df

          salary       age  seniority  Extra
atil    0.763001 -0.808882  -2.451890     10
zeynep -0.529680 -0.585992   0.301743     10
atlas  -1.795230 -0.231042   0.117421     10
mehmet  1.116742  0.581142  -1.614240     10

In [23]:
new_df.drop("Extra", axis=1)

          salary       age  seniority
atil    0.763001 -0.808882  -2.451890
zeynep -0.529680 -0.585992   0.301743
atlas  -1.795230 -0.231042   0.117421
mehmet  1.116742  0.581142  -1.614240

In [24]:
new_df

          salary       age  seniority  Extra
atil    0.763001 -0.808882  -2.451890     10
zeynep -0.529680 -0.585992   0.301743     10
atlas  -1.795230 -0.231042   0.117421     10
mehmet  1.116742  0.581142  -1.614240     10

In [26]:
new_df.drop("Extra", axis=1, inplace=True)

In [27]:
new_df

          salary       age  seniority
atil    0.763001 -0.808882  -2.451890
zeynep -0.529680 -0.585992   0.301743
atlas  -1.795230 -0.231042   0.117421
mehmet  1.116742  0.581142  -1.614240

In [44]:
new_df["mehmet"]=10

In [45]:
new_df

          salary       age  seniority  mehmet
atil    0.763001 -0.808882  -2.451890      10
zeynep -0.529680 -0.585992   0.301743      10
atlas  -1.795230 -0.231042   0.117421      10
mehmet  1.116742  0.581142  -1.614240      10

In [46]:
new_df.drop("mehmet")

          salary       age  seniority  mehmet
atil    0.763001 -0.808882  -2.451890      10
zeynep -0.529680 -0.585992   0.301743      10
atlas  -1.795230 -0.231042   0.117421      10

In [47]:
new_df.drop("mehmet", axis=1, inplace=True)

In [48]:
new_df

          salary       age  seniority
atil    0.763001 -0.808882  -2.451890
zeynep -0.529680 -0.585992   0.301743
atlas  -1.795230 -0.231042   0.117421
mehmet  1.116742  0.581142  -1.614240

In [49]:
new_df.loc["atlas"]

salary      -1.795230
age         -0.231042
seniority    0.117421
Name: atlas, dtype: float64

In [50]:
new_df.loc["atlas"]["salary"]

np.float64(-1.795229625170152)

In [51]:
new_df.loc["atlas" , "salary"]

np.float64(-1.795229625170152)

In [53]:
new_df.loc["atlas","salary"] = 100

In [54]:
new_df

            salary       age  seniority
atil      0.763001 -0.808882  -2.451890
zeynep   -0.529680 -0.585992   0.301743
atlas   100.000000 -0.231042   0.117421
mehmet    1.116742  0.581142  -1.614240

In [55]:
new_df > 0

        salary    age  seniority
atil      True  False      False
zeynep   False  False       True
atlas     True  False       True
mehmet    True   True      False

In [57]:
new_df[new_df>0]

            salary       age  seniority
atil      0.763001       NaN        NaN
zeynep         NaN       NaN   0.301743
atlas   100.000000       NaN   0.117421
mehmet    1.116742  0.581142        NaN

In [59]:
new_df["salary"] > 1

atil      False
zeynep    False
atlas      True
mehmet     True
Name: salary, dtype: bool

In [60]:
new_df.reset_index()

    index      salary       age  seniority
0    atil    0.763001 -0.808882  -2.451890
1  zeynep   -0.529680 -0.585992   0.301743
2   atlas  100.000000 -0.231042   0.117421
3  mehmet    1.116742  0.581142  -1.614240

In [61]:
new_df

            salary       age  seniority
atil      0.763001 -0.808882  -2.451890
zeynep   -0.529680 -0.585992   0.301743
atlas   100.000000 -0.231042   0.117421
mehmet    1.116742  0.581142  -1.614240

In [72]:
reset_frame = new_df.reset_index()

In [73]:
reset_frame

    index      salary       age  seniority NewIndex
0    atil    0.763001 -0.808882  -2.451890      ati
1  zeynep   -0.529680 -0.585992   0.301743    zeyno
2   atlas  100.000000 -0.231042   0.117421      atl
3  mehmet    1.116742  0.581142  -1.614240     memo

In [74]:
reset_frame.loc[0]

index            atil
salary       0.763001
age         -0.808882
seniority    -2.45189
NewIndex          ati
Name: 0, dtype: object

In [75]:
NewIndices = ["ati", "zeyno", "atl", "memo"]

In [76]:
new_df["NewIndex"] = NewIndices
new_df

            salary       age  seniority NewIndex
atil      0.763001 -0.808882  -2.451890      ati
zeynep   -0.529680 -0.585992   0.301743    zeyno
atlas   100.000000 -0.231042   0.117421      atl
mehmet    1.116742  0.581142  -1.614240     memo

In [78]:
new_df.set_index("NewIndex", inplace=True)

In [79]:
new_df

              salary       age  seniority
NewIndex
ati         0.763001 -0.808882  -2.451890
zeyno      -0.529680 -0.585992   0.301743
atl       100.000000 -0.231042   0.117421
memo        1.116742  0.581142  -1.614240

In [80]:
new_df.loc["ati"]

salary       0.763001
age         -0.808882
seniority   -2.451890
Name: ati, dtype: float64